

[
    {
        "date": "15.11.2024 - 11:57",
        "logs": [
            "Sound Library Überarbeitet",
            "Sound Library Neue Collection für spätere Einbindungen",
            "Sound Library Position & Entity updates sind nun mehr Separiert",
            "Sound Library Spieler Bezogene Sounds werden nicht mehr via Entity Sounds abgespielt",
            "Sound Library & Audio Library sind nun Separat (dies sollte einige Ladezeiten Verkürzen u.a. auch bei arbeiten an der Sound Library)"
        ]
    },
    {
        "date": "04.11.2024 - 01:22",
        "logs": [
            "Positionaler Sound im Fahrzeug wurde nicht korrekt Reguliert (lautstärke)",
            "Saltychat resource geändert",
            "Leichte Performance anpassungen"
        ]
    },
    
    {
        "date": "03.11.2024 - 17:09",
        "logs": [
            "Lenkverhalten ist nur noch auf Fahrzeuge Begrenzt (keine Motorräder, Fahrrader, Helikopter, Flugzeuge, Züge etc.)",
            "Feuerwache 1 Standort vom Hauptplatz zum Strand Verschoben (MP Standort wird für das Autohaus Freigelegt)",
            "Kleidungs Menu - Whitelist - Blacklist - Eingebunden",
            "das Charakter Menu kann absofort nicht mehr mit [ESC] Geschlossen werden und muss über dem Reiter Speichern nun geschlossen werden <br><ol><li>(damit sollten charakter erstellungen nicht mehr versehentlich abgebrochen werden können!)</li></ol><br> das Kleidungs Menu ist davon nicht betroffen."
        ]
    },

    {
        "date": "31.10.2024 - 19:00",
        "logs": [
            "beim schließen eines Menus (mit [ESC] wo sich der spieler nebenbei bewegen kann) wurde das Pausemenu zusätzlich geöffnet.",
            "Kleidungsläden erste Beta für Charakter Erstellung - Aktuell nicht kaufbar",
            "Charakter Erstellung beinhaltet nun auch Brillen",
            "Charakter Erstellung - Überarbeitet",
            "Neue Skin - Verwaltung"
        ]
    },
    
    {
        "date": "28.10.2024 - 0:10",
        "logs": [
            "Telefon konnte nicht geöffnet werden (ungültige simkarte)",
            "Bossmenu accounts konnten mehrfach eingeloggt sein",
            "Einige Einstellungen bei einigen Telefonen wurden nicht korrekt gespeichert",
            "Kleidungsläden sind derzeit nur begränzt zugänglich & Speichern derweil nicht!"
        ]
    },
    
    {
        "date": "27.10.2024 - 20:04",
        "logs": [
            "Neues Pausemenu",
            "Loading Screen Überarbeitet",
            "Changelog im Pausemenu Hinterlegt",
            "Hintergrund Musik im Pausemenu Hinzugefügt",
            "Informationen (News) im Pausemenu Hinterlegt",
            "Informationen (News) im Loadingscreen Hinterlegt",
            "Datum & Uhrzeit im Pausemenu Hinterlegt",
            "Spieler Ping im Pausemenu Hinterlegt",
            "Spieler Ping im Pausemenu ist nun Farblich Hinterlegt (je nach ping)",
            "ein fehler im Framework behoben welcher einen Inkorrekten CB Wiedergegeben hat",
            "Closed Beta Mitgliedern Freigeschalten",
            "Verbundene Spieler werden nun im Pausemenu Angezeigt, unter dem button: 'Spieler'",
            "Bugreports Hinzugefügt zum Pausemenu",
            "Warnblinker lassen sich nun nicht mehr abschalten mit dem setzeen eines anderen Blinkers (links oder rechts). um einen blinker zu setzten muss der warn blinker erst deaktiviert werden",
            "Rockstar Editor vorerst entfernt"
        ]
    }
]
